






## 데이터 탐색

### EDA

### 결측값
    R 기준으로, NA로 표현. 경우에 따라 null, 공백, -1 등 다양하게 표현될 수도 있다.  
    
    결측값은 삭제하는 것이 일반적. (단, 설문에서 결측값이 많다는 것은 해당 질문에 민감함을 나타내는 측도로 사용될 수도 있다.)

- 단순 대치법
- 평균 대치법
    - 비조건부 평균 대치법
    - 조건부 평균 대치법
- 단순 확률 대치법: 평균 대치법에서 추정량 표준 오차의 과소 추정 문제를 보완하고자 고안된 방법
    - K-Nearest Neighbor 방법
- 다중 대치법: 여러 대치를 통해 만드는 방법. 대치 - 분석 - 결합 3단계로 구성.

### 이상값
    이상값도 제거하는 것이 일반적이지만, 의미를 갖는 경우도 있으므로 목적이나 종류에 따라 사용자의 적절한 판단이 필요.

- ESD (Extreme Studentized Deviation): 평균에서 표준편차 3을 넘어가면 이상값.
- 사분위수: box plot. Q3 + 1.5 IQR과 Q1 - 1.5 IQR 을 넘어가면 이상값.

## 통계와 표본조사

### 표본추출 방법
- 단순 랜덤 추출법
- 계통 추출법: 일정한 간격으로 추출.
- 군집(Cluster / 집락) 추출법: 군집 간은 서로 동질적, 군집 내의 데이터는 이질적
- 층화 추출법: 층 강은 서로 이질적, 층 내의 데이터는 동질적.
    - 층별로 추출할 데이터의 비율을 정하는 방법에 따라, 비례 층화 추출, 불비례 층화 추출이 있다.

### 척도
- 질적 척도
    - 명목 척도
    - 순서 척도
- 양적 척도
    - 등간 척도 (구간 척도)
    - 비율 척도

### 기술통계와 추리통계

기술통계
- 표본 자체의 속성이나 특징을 파악하는데 중점.
- 자료를 요약, 조직화, 단순화하는 게 목적.

추리통계 (추론통계)
- 표본에서 얻은 통계치를 바탕으로 오차를 고려하면서, 모수를 확률적으로 추정하는 통계기법
- 모집단의 특성을 추정하기 위해, 가설을 검증하거나 확률적인 가능성을 파악함.


## 확률과 확률분포

### 확률
확률  
조건부 확률

독립사건  
배반사건

확률변수  
확률분포


## 이산 확률 분포

### 베르누이 분포

### 이항 분포

### 기하 분포

### 다항 분포

### 포아송 분포

### 이산 확률 변수

<br>

## 연속 확률 분포

### 균일 분포

### 정규 분포

### 표준 정규 분포

### t-분포

### 카이제곱 분포

### F 분포

### 연속 확률 변수


## 통계 개념

기댓값  
분산  
표준편차  
첨도  
왜도  
공분산  
상관계수


## 추정과 가설검정

### 추정

#### 모수 추정

#### 점추정

#### 구간추정

<br>

### 가설검정

#### 귀무가설
#### 대립가설
#### 제 1종 오류
#### 제 2종 오류
#### 검정통계량
#### 기각역, 유의수준, 유의 확률(=p-value)
p-value가 유의수준보다 작으면, 귀무가설 기각.

<br>

### 모수 검정 vs 비모수 검정

#### 모수 검정
- 표본이 정규성을 갖는다는 모수적 특성을 이용하는 통계 방법  

#### 비모수 검정
- 정규성 검정에서 정규분포를 따르지 않는다고 증명되거나, 표본 군집당 10명 미만의 소규모 실험이라 정규분포임을 가정할 수 없는 경우에 사용.
- 모수의 분포에 대해 어떠한 가정(정규분포)도 하지 않는 검정.

| 모수 검정 | 비모수 검정  |
|------------------------------------------------------------------------|-----------------------------------------------------------------|
| 등간척도, 비율척도 | 명목척도, 서열척도 |
| 평균  | 중앙값  |
| 피어슨 상관계수 | 스피어만 순위상관계수 |
| one sample t-test, two samplet t-test,<br>paired t-test, one way anova | 부호검정, Wilcoxon 부호 순위 검정, <br>Mann-Whitney 검정, Kruskal Wallis 검정 |

<br>
<br>

## 기초 통계

### t-검정

#### 단일 표본 t-검정 (One sample t-test)
    하나의 모집단의 평균값을 특정값과 비교하는 경우 사용하는 통계적 분석 방법.

#### 독립 표본 t-검정 (Independent sample t-test) (이 표본 t-검정)
    서로 독립적인 두 개의 집단에 대하여, 모평균이 같은 값을 갖는지 통계적으로 검정하는 방법

    등분산성을 만족해야 한다. 따라서 F 검정을 먼저 해야 함.

#### 대응 표본 t-검정 (Paired t-test)
    동일한 대상에 대해 두 가지 관측치가 있는 경우, 둘의 차이가 있는지 검정

    주로 실험 전후의 효과 비교에 사용


### 분산분석 ANOVA
세 개 이상의 모집단이 있을 경우, 이들의 평균을 비교하는 검정 방법.  

- 귀무가설은 항상 "$H_0$: 모든집단 간 평균은 같다."

- 귀무가설을 기각할 경우 어느 집단 간 평균이 같은지, 혹은 얼마나 다른지 알수 없다는 단점이 있다. -> 사후 검정 방법으로 Scheffe, Tuckey, Duncan, Fisher's LSD, Dunnett, Bonferroni 등의 방법을 사용하면 된다.
- 독립변수는 범주형, 종속변수는 연속형 이어야 한다.
- "집단 간 분산 / 집단 내 분산" 인 F-value가 사용됨.
- 분산 분석을 위한 세 가지 가정사항  
>1. 정규성: 각 집단의 표본들은 정규분포를 따라야 한다.
>2. 등분산성: 각 집단은 동일한 분산을 가져야 한다.
>3. 독립성: 각 집단은 서로에게 영향을 주지 않는다.

#### 분산분석표
p.220

#### 일원분산분석 (One-way Anova)
    독립 변수가 하나 일 때.

#### 이원분산분석 (Two-way Anova)
    독립 변수가 두 개 이상일 때.  
    독립변수 간 교호작용이 있다고 판단될 때는 '반복이 있는 실험'을 하고, 교호작용이 없다고 판단될 때는, 즉 두 독립변수가 독립인 경우에는 '반복이 없는 실험'을 한다.

#### 다변량분산분석 = 다원분산분석 (Manova)
    종속 변수가 두 개 이상일 때.


### 교차 분석

    범주형 자료 간의 관계를 알아보고자 할 때 사용하는 분석방법

- 카이제곱 검정통계량을 사용
- 적합도 검정, 독립성 검정, 동질성 검정에 사용
- 교차 분석표
    - 두 범주형 변수를 교차하여 데이터의 빈도를 표 형태로 나타낸 것

#### 적합도 분석
    실험결과 얻어진 관측값이 예상값과 일치하는지 여부를 검정
- $H_0$ : 실제 분포와 예측 분포간에는 차이가 없다.
- $a$ : 0.05
- $\chi _{a, df}$　 (자유도 df = 범주수 -1)


#### 독립성 분석
    모집단이 두 개의 변수에 의해 범주화됐을 때, 그 두 변수들 사이의 관계가 독립적인지를 검정
- 카이제곱 검정에 의한 독립성 검정 결과는, 두범주형 변수 간에 관계가 있는지 없는지만을 나타낼 뿐이며, 강도를 말해주지 않는다. 따라서 상관관계의 강도를 알기 위해서는 상관분석을 해야 한다.
#### 동질성 분석
    관측값들이 정해진 범주 내에서 서로 비슷하게 나타나는지를 검정.
    즉, 두 집단의 분포가 동일한 모집단에서 추출된 것인지를 검정.
    

### 상관 분석
    두 변수 간의 선형적 관계가 존재하는지 알아보는 분석 방법.
    상관계수를 활용.
- 상관간계가 있단느 것이 반드시 인과관계가 있다는 말은 아니다. 상간관계는 존재하지만 인과관계는 없을 수도 있다.
- 상관분석의 귀무가설은 "$H_0$ : $\gamma_{xy}$ = 0 (두 변수는 상관관계가 없다.)"

#### 산점도 행렬

#### 피어슨 상관분석 (선형적 상관관계)
    모수적 방법의 하나로, 두 변수가 모두 정규분포를 따른다는 가정이 필요.

#### 스피어만 상관분석 (비선형적 상관관계)
    비모수적 방법으로, 관측값의 순위에 대해 상관계수를 계산하는 방법.
    두 변수들이 서열척도일 때 사용.

<br>

## 회귀 분석

    하나 이상의 독립변수들이 종속변수에 얼마나 영향을 미치는지 추정
- 독립변수와 종속변수 간에 인과관계가 있다.
- 독립변수가 하나면 단순선형회귀분석, 독립변수가 여러개면 다중선형회귀분석
- 보통 연속형 변수일 때 사용. 범주형 변수는 파생변수로 변환해야 함. 만약 종속변수가 범주형이라면 로지스틱 회귀분석.

### 회귀  분석의 가정
- 선형성
- 독립성
- 등분산성
- 정규성
p.233

### 단순 선형 회귀 분석
- 최소제곱법으로 오차가 작아지는 회귀추세선을 찾는다.

**회귀분석 모형의 적합성**  
p.235

### 다중 선형 회귀 분석

**다중공선성**  
- 진단
    - 결정계수 값이 커서 회귀식의 설명력은 높지만, 각 독립변수의 p-value가 커서 개별 인자가 유의하지 않을 경우, 의심 가능.
    - 독립변수 간 상관계수를 구하거나, VIF (분산팽창요인)이 10을 넘기면 다중공선성이 있음.
    - VIF = $\displaystyle\frac{1}{1-R^2}$
- 해결
    - 변수를 제거
    - PCA(주성분분석)로 차원 축소
    - SVD(특잇값 분해)로 차원 축소
    - LDA(선형판별분석)로 차원 축소
    - t-SNE(t-분포 확률적 임베딩)로 차원 축소

### 최적 회귀 방정식
    종속변수 y를 가장 잘 설명하는 독립변수 후보를 찾는 것.
- 부분집합법
    - 모든 가능한 모델을 고려하여 가장 좋은 모델을 성정하는 방법
    - 변수의 개수가 적은 경우, 높은 설명력을 가진 결과를 도출하는데 효과적. 변수가 많으면 검증해야하는 회귀 분석도 많아지는게 단점.
    - 임베디드 기법이라고도 함. 라쏘, 릿지, 엘라스틱넷 등의 다양한 방법을 사용
- 단계적 변수선택법

<br>

**벌점화(페널티 penalty) 방식　AIC, BIC**
- 회귀 모형은 변수의 수가 증가할수록 편향(bias)은 작아지고 분산은 커지는 경향이 있다.

> AIC (Akaike Information Criteria)  
> - MSE에 변수 수만큼 페널티를 주는 지표.  
> - 일반적으로 회귀분석에서 Model Selection할 때 많이 씀  
>
> BIC
> - AIC의 단점인, 표본의 수(n)가 커질 때 부정확하다는 단점을 보완한 지표.
> - BIC는 변수의 개수가 많을수록 AIC보다 더 큰 페널티를 주기 때문에, 변수의 개수가 적은 모형이 우선이라면 BIC를 참고하는 것을 권장.
>
> 멜로우 Cp (Mallow's Cp)
> - Cp값은 최소자승법으로 사용하여 추정된 회귀모형의 적합성을 평가하는데 사용.
> - Cp값은 수정된 결정계수 및 AIC와 밀접한 관련이 있다.
> - Cp값이 p값보다 크면 나쁜 모델, Cp값이 p값보다 작으면 좋은 모델.

<br>

**단계적 변수 선택법**
> 전진선택법  
> - 상관계수 절댓값이 큰 변수에 대해 부분 F 검정을 실시한다. 그리고 설명력이 가장 높은 설명변수(p-value가 가장 작은 변수)부터 선택해나간다.  
>
> 후진제거법  
> 단계별 방법  

<br>

### 고급 회귀 분석

#### 정규화 선형회귀
**과적합 & 과소적합**

**정규화 선형회귀**
- 라쏘
- 릿지
- 엘라스틱넷

#### 일반화 선형회귀
**로지스틱 회귀**  
**포아송 회귀**

#### 더빈 왓슨 검정

<br>
<br>

## 다변량 분석

### 다차원 척도법
    객체 간의 근접성을 시각화하는 통계기법
- 유클리드 거리행렬을 사용.
- stress 값 사용. 0 ~ 1로, 0은 완벽, 0.05이내면 적합도가 좋고, 0.15 이상은 적합도가 안 좋은 것.

### PCA　주성분 분석
    서로 상관성이 높은 변수들을 선형 결합하여 새로운 변수를 만들고 차원을 축소

- 손실이 가장 작은 축을 찾아야 함. 즉, 자료의 분산이 가장 큰 축을 찾아야 함.
- 고유값?

































































